{
    "title": "2022 Fidelissma Criminal Act",
    "referenceCode": "ACT_2021_00001",
    "author": {
        "id": "483906363492401163",
        "username": "Luke Nguyen Khanh#6053"
    },
    "description": "Criminal laws for Fidelissma.",
    "dateOfApproval": "9-1-2022",
    "isRepealed": false,
    "isApproved": true,
    "content": "**AN ACT**\n    *of the Congress of the Bayer Free State*\n    reference code ACT_2022_00001.\n    \n    This legislation shall be cited as the \"2022 Fidelissma Criminal Act\".\n    \n    __Article 1__\n    \n    *Section 1:* This Act shall apply to all Bayer Free State citizens who commit crimes in the Constituent State of Fidelissma.\n    \n    *Section 2:* This Act shall apply to any person committing crimes in the Constituent State of Fidelissma with the trial shall be held in the Constituent State of Fidelissma and the Jury shall be the players of it.\n    \n    __Article 2__\n    \n    Punishments shall be imposed on the IP of the person committing crimes. If enforcing punishment is not possible by using IP, another alternative punishment shall be issued with an official document.\n    \n    __Article 3__\n    \n    One, multiple, or all of the following may be legally used by the State as punishments for offenders of this Act:\n    (a) Warning: A written warning may be issued and shall expire after 30 days since the issuing date.\n    (b) Forced travel restriction: A guilty person may forced to restrict their movement to a predefined area and/or prevented from travel to a specific area no more than 180 days. If the person violates this, an automatic kill command shall be executed to prevent the person from entering or exiting the area. The free movement area should:\n    - consist of at least 4 full chunks including public space and accessibility enough to sustain stable living standard;\n    - contain their own permanent residence property or public housing;\n    - is not an isolated area or a special protective area;\n    - free from any surveillance.\n    (c) Ban: A guilty person may be forcibly removed from, and denied entry into the Constituent State of Fidelissma, either indefinitely, or not for more than 90 days. When receiving indefinite ban, all of the private properties owned by that person shall be confiscated by the law enforcement agency.\n    \n    __Article 4: Intepretation__\n    \n    *Section 1:* In this act: \n    - Builds: Any group of blocks that have the intention to serve as a whole, with or without connection, not limited to building or machine.\n    - Building: Any group of static blocks that have the intention to be physically connected together, serving one single reasonable purpose or be used as a whole.\n    - Machine: Any group of dynamic blocks that have the intention to be connected together serving one single reasonable purpose using redstone and other game mechanics.\n    \n    *Section 2:* The interpretations in Section 1 should only be used when no other legislation define the meaning of it. \n    \n    __Article 5: Pilferage__\n    \n    *Section 1:* A person shall be guilty of pilferage if that person takes items or blocks that were not declared to be used or taken by the public, either with verbal warnings, written statements, visual aids, or other forms of protection to the property. \n    \n    *Section 2:* If the pilferage act was proven to be accidental, the person shall return all of the taken properties.\n    \n    *Section 3:* A person guilty of pilferage shall be issued a warning; imposed a travel restriction for no more than 3 days; or banned for no more than 7 days.\n    \n    __Article 6: Items duplicating__\n    \n    *Section 1:* A person shall be guilty of items duplicating of that person organizes, maintains, or making builds, or actions that duplicate non-renewable resources\n    \n    *Section 2:* A person shall not be guilty of item duplication if they duplicate renewable resources, which:\n    - can be obtained without exploring more of the map;\n    - can be obtained normally under survival mode; \n    - can be obtained via villager trade; or\n    - is a spawnable mob drop.\n    \n    *Section 3:* A person guilty of items duplicating shall be imposed a travel restriction temporary or indefinitely; or banned for no more than 90 days. \n    \n    __Article 7: Performance disruption__\n    \n    *Section 1:* A person shall be guilty of performance disruption if that person organizes, maintains, or making builds, or actions that:\n    - cause the server performance to drop significantly;\n    - cause annoyance, disruption to Fidelissma citizens; or \n    - make Fidelissma citizens unable to join the server.\n    \n    *Section 2:* A person guilty of performance disruption shall be banned, temporary or indefnitely, from the server.\n    \n    __Article 8: Griefing__\n    \n    *Section 1:* A person shall be guilty of griefing if that person destroys, partially or entirely, builds that were claimed by others or declared as public building. \n    \n    *Section 2:* A person shall be guilty of public vandalism if that person destroys builds that were claimed, contributed, or being used by the public. \n    \n    *Section 3:* A person guilty of griefing shall be imposed a travel restriction for no more than 7 days; or banned, temporary or indefinitely, from the server. \n    \n    __Article 9: Trespassing__\n    \n    *Section 1:* A person shall be guilty of trespassing if that person enters or invades, with or without force, a private building without permission.\n    \n    *Section 2:* A person shall be guilty of invasion of private property if that person, using force or any other means to threaten, enters, or open buildings without permission.\n    \n    *Section 3:* A person guilty of trespassing shall be issued a warning; imposed a travel restriction for no more than 3 days; or banned for no more than 7 days.\n    \n    __Article 10: Robbery__\n    \n    *Section 1:* A person shall be guilty of robbery if that person obtained items from another person by: \n    - force, either directly or not; \n    - threats, verbally or physically; or\n    - murdering to get the item from another person's inventory loot.\n    \n    *Section 2:* A person shall not be guilty of robbery by Section 1 Clause 3 if the act was proven to be accidental and that person makes no attempt to keep the items.\n    \n    *Section 3:* A person guilty of robbery shall be imposed a travel restriction for no more than 3 days; or banned for no more than 28 days.\n    \n    __Article 11: Unfair advantage__\n    \n    *Section 1:* A person shall be guilty of gaining unfair advantage if that person performs actions, uses or making softwares or resource pack, that gain an advantage that is not possible or not as efficient under normal circumstances; or obtaining items with methods that is not available to all users.\n    \n    *Section 2:* A person shall be guilty of X-Ray if that person uses resource packs or softwares to increase the ability to find a specific resource or people.\n    \n    *Section 3:* A person guilty of gaining unfair advantage shall be imposed a travel restriction for no more than 7 days; or banned temporary or indefinitely.\n    \n    __Article 11: Revocation__\n    \n    All legislation regarding crimes that was enacted in the Constituent State of Fidelissma before this Act shall be revoked.",
    "amendments": []
}