{
    "title": "2021 Immigration Act",
    "referenceCode": "ACT_2021_00006",
    "author": {
        "id": "584597326543323139",
        "username": "callmepeterz#1300"
    },
    "description": "Immigration proceedures",
    "dateOfApproval": "01-11-2021",
    "isRepealed": false,
    "isApproved": true,
    "content": "**AN ACT**\n    *of the Congress of the Bayer Free State*\n    reference code ACT_2021_00006.\n    \n    *Be it enacted by this Congress*, That, this legislation shall be cited as the \"2021 Immigration Act\".\n    \n    \n    \n    ***Part I** Establishment of the Immigration Board*\n    \n    __Article 1__ An Immigration Board shall be established under the administration of the executive branch.\n    \n    __Article 2__ The Immigration Board shall consist of the Head of State, the Prime Minister or the Deputy Prime Minister, and a citizen not holding any executive or judicial office appointed by the Prime Minister, who shall serve until the end of the term of the Prime Minister, resignation, or recall by the Prime Minister.\n    \n    __Article 3__ The Immigration board shall have the duty of\n        - Researching, analyzing, and deciding on citizenship applications, petitions, suspensions, and revocations;\n        - Determining the criteria for citizenship eligibility that does not interfere with a person's inalienable rights; \n        - Leading, prosecuting, or assisting court cases concerning citizenship; and\n        - Resolving matters concerning citizenship.\n    \n    \n    ***Part II** Temporary permit*\n    \n    __Article 4__ A temporary permit may be granted to a non-citizen applying for citizenship by the Immigration Board.\n    \n    __Article 5__ A temporary permit shall expire after 14 days, or when the Immigration Board decides to revoke it, in which case a decision for whether to grant citizenship or not to the said person must be made within 24 hours.\n    \n    __Article 6__ A person carrying a temporary permit shall be temporarily allowed to enter the Bayer Free State, and shall have full constitutional rights and protections defined in Article I of the Constitution, with the exception of the immediate right to citizenship as defined in Section 1, and the right to vote as defined in Section 6. A person carrying a temporary permit shall not be eligible to hold any offices of all branches of government.\n    \n    __Article 7__ A person carrying a temporary permit shall have full access to the guild, with the exception of channels categorized as Not Safe For Work.\n    \n    __Article 8__ A person carrying a temporary permit committing crimes shall be prosecuted under Bayer criminal laws as a full citizen.\n    \n    \n    ***Part III** Immigration procedures*\n    \n    __Article 9__ After joining the guild, a person wishing to be granted citizenship shall submit a formal application to one of the members of the Immigration Board. The Immigration Board shall have 24 hours to respond and may conduct an interview with the said person, then shall decide with a majority vote to whether or not grant the person a temporary permit in accordance with the criteria. If the person is granted a temporary permit, that person shall enjoy the rights and privileges as defined in Article 6 of this Act. Within 14 days, the Immigration board shall decide whether the person shall be granted citizenship or not in accordance with the criteria.\n    \n    __Article 10__ At any point during the waiting, interviewing, or temporary permit period, a person may be suspended from the process for no more than 30 days, kicked, banned, or refused entry by the Immigration Board with a majority for intolerable or unacceptably offensive behaviors, ill intentions, or imminent illegal actions.\n    \n    __Article 11__ The interview conducted with a person shall not last an unreasonably and unnecessarily lengthy period of time; nor shall it be unreasonably intrusive towards the person's privacy; nor shall it violate any of the person's inalienable rights and liberties.\n    \n    __Article 12__ When the majority vote in the Immigration Board fails to grant citizenship to a person, that person shall be eligible for application again after a period of 24 hours.\n    \n    __Article 13__ After joining the guild, with the recommendation of either the Prime Minister or the Head of State, and the approval of the majority of the Immigration Board, a person shall be immediately granted citizenship.\n    \n    \n    ***Part IV** Revocation and temporary suspension of Citizenship*\n    \n    __Article 14__ With the permission of the Court, the Immigration Board may revoke citizenship of a person for a determined period of time or indefinitely for grave crimes or other reasons. The said person shall be eligible to apply for citizenship after the aforementioned period.\n    \n    __Article 15__ With the permission of the Court and sufficient evidence, the Immigration Board may temporarily suspend citizenship of a person suspecting to be indefinitely or prolongedly inactive. The said person shall be immediately granted citizenship again after submitting a request to and being confirmed by the Immigration Board.\n    \n    \n    ***Part V** Exemption for former citizens*\n    \n    __Article 16__ A person who in the past has held citizenship which was suspended only due to voluntary leave shall be immediately granted citizenship upon joining the guild within 60 days since leaving. \n    ",
    "amendments": []
}