{
    "title": "2021 Fidelissma Aquisition Act",
    "referenceCode": "ACT_2021_00007",
    "author": {
        "id": "584597326543323139",
        "username": "callmepeterz#1300"
    },
    "description": "Acquires Fidelissma and sets out some basic laws.",
    "dateOfApproval": "12-12-2021",
    "isRepealed": false,
    "isApproved": true,
    "content": "**AN ACT**\n    *of the Congress of the Bayer Free State*\n    reference code ACT_2021_00007.\n    \n    *Be it enacted by this Congress*, That, this legislation shall be cited as the \"2021 Fidelissma Acquisition Act\".\n    \n    \n    \n    __Article 1__ The Constituent State of Fidelissma shall hereby be declared to be in possession of the Bayer Free State.\n    \n    __Article 2__ The Constituent State of Fidelissma shall consist of the Minecraft world known as \"the SMP\" being hosted on the address jiagai.aternos.me, or any other addresses which shall be amended to this Act.\n    \n    __Article 3__ The Constitution of the Bayer Free State, the legislations enacted both before and after the enactment of this Act, court orders, case laws thereof shall apply equally on the Constituent State of Fidelissma and its subjects.\n    \n    __Article 4__ All governmental functions in Fidelissma shall be assumed by the Government of the Bayer Free State.\n    \n    __Article 5__ The person owning the server on which hosts Fidelissma shall comply and act accordingly with the laws of the Bayer Free State.\n    \n    __Article 6__ Any subjects wishing to become a citizen of the Bayer Free State shall be subject to the immigration process as laid out by those acts, with the exception of those who have been Fidelissma subjects before the enactment of this Act, who shall be exempt from the said process.\n    \n    __Article 7__ Should the subjects of Fidelissma wish to withdraw from this union with the Bayer Free State, a fair and secret referendum shall be held among the subjects, and with a three quarters majority, this Act shall be nullified.",
    "amendments": []
}