{
    "title": "2021 Criminal Act",
    "referenceCode": "ACT_2021_00005",
    "author": {
        "id": "584597326543323139",
        "username": "callmepeterz#1300"
    },
    "description": "Crimes and punishments",
    "dateOfApproval": "16-09-2021",
    "isRepealed": false,
    "isApproved": true,
    "content": "**AN ACT**\n    *of the Congress of the Bayer Free State*\n    reference code ACT_2021_00005.\n    \n    _Be it enacted by this Congress_, That, this legislation shall be cited as the \"2021 Criminal Act\".\n    \n    \n    ***Part I** General Provisions*\n    \n    __Article 1__\n    \n    Section 1: The criminality and punishability of an act shall be determined by the law in effect at the time of the commission of that act.\n    \n    Section 2: When a law is changed after the commission of a crime, such act thereby no longer constitutes a crime under the new law, or the punishment therefor under the new law becomes less severe than under the previous law, the new law shall apply.\n    \n    Section 3: When a law is changed after the sentence for a crime committed under the previous law has become final and such act thereby no longer constitutes a crime, the execution of the punishment shall be remitted.\n    \n    __Article 2__\n    \n    Section 1: This Act shall apply to all citizens committing crimes within the Bayer Free State.\n    \n    Section 2: This Act shall apply to any persons committing the following crimes in direct messages where at least one citizen of the Bayer Free State is present with at least one party giving consent to the State:\n        - Harassment\n        - Sexual harassment\n        - Fraud\n        - Infringement of privacy\n        - Impersonation\n        - Treason\n        - Insurrection\n        - Conspiracy to commit crimes within the Bayer Free State\n    \n    Section 3: This Act shall apply to any persons outside of the Bayer Free State committing insurrection and conspiracy to commit crimes within the Bayer Free State.\n    \n    __Article 3__\n    \n    The general provisions of this Act shall apply to other Acts providing statutes concerning crimes, unless stated otherwise by such Acts. \n    \n    __Article 4__\n    \n    Punishments for a person classified as a juvenile may be mitigated.\n    \n    __Article 5__\n    \n    Punishments shall be imposed on both the main and alternative accounts of a person committing crimes.\n    \n    __Article 6__\n    \n    Section 1: An act which is performed in order to prevent impending and unjust infringement of one's own or another person's legal interest shall not be punishable if there are reasonable grounds for that act.\n    \n    Section 2: When a preventive act has exceeded normal limits, the punishment may be mitigated or remitted according to the extenuating circumstances.\n    \n    Section 3: In the case of the preceding section, an act performed through fear, surprise, excitement, or confusion in the night or under other extraordinary circumstances shall not be punishable.\n    \n    __Article 7__\n    \n    Section 1: When an intended crime is not completed or if the intended result does not occur, it shall be punishable as an attempted crime.\n    \n    Section 2: When a conspiracy or the preparatory action for a crime has not reached the commencement stage for the commission of the crime, it shall be punishable as a conspiracy to commit such crime.\n    \n    Section 3: When a person is convicted of a crime for which that person has previously been convicted, that person shall be punished as a habitual offender.\n    \n    Section 4: A person committing attempted crimes and conspiracy to commit crimes shall be punished as provided in the Articles providing for the intended crimes. Punishments in this case may be mitigated or remitted.\n    \n    Section 5: Punishments for a habitual offender may be increased depending on the severity and the frequency of the crimes.\n    \n    __Article 8__\n    \n    For a person who instigates another to commit a crime, the same punishment shall be applied to the instigator as one who actually commits the crime.\n    \n    __Article 9__\n    \n    Section 1: One, multiple, or all of the following may be legally used by the State as punishments for offenders of this Act:\n    \n    (a) Warning: A written warning may be issued and shall expire after 30 days since the issuing date.\n    (b) Mute: A guilty person may be deprived of the right to talk in the Bayer Free State, either indefinitely, or not for more than 30 days.\n    (c) Kick: A guilty person may be forcibly removed from the Bayer Free State.\n    (d) Ban: A guilty person may be forcibly removed from, and denied entry into the Bayer Free State, either indefinitely, or not for more than 90 days.\n    (e) Refusal of entry: A guilty person outside of the Bayer Free State may be denied entry into the Bayer Free State, either indefinitely, or not for more than 90 days.\n    (f) Deprivation of qualifications: A guilty person may be deprived of the right to become an officer holding public offices of the Bayer Free State.\n    (g) Suspension of qualifications: A guilty person holding public offices may be forcibly removed from such offices.\n    \n    Section 2: The citizenship of a person shall be revoked if that person is indefinitely banned from or indefinitely denied entry into the Bayer Free State.\n    \n    Section 3: A guilty person shall be derived of qualifications to hold public offices of the Bayer Free State as defined in Section 1 Clause (f) of this Article if any punishment provided by Article 9, Section 1, Clauses from (a) to (e) is applied to that person, and the duration of the deprivation shall be equal to the term of the applied punishments.\n    \n    Section 4: Punishments for a guilty person outside of the Bayer Free State shall be changed to refusal of entry as described by Section 1 Clause (e) of this Article.\n    \n    __Article 10__\n    \n    In determining punishment, the following shall be taken into consideration:\n        - The age, character, conduct, and intelligence of the offender;\n        - Offender's relation to the victim;\n        - The motive for the commission of the crime, the means and the result; and\n        - Circumstances after the commission of the crime.\n    \n    __Article 11__\n    \n    When voluntary confession is made which aids the investigation of the crime, the punishment may be mitigated or remitted.\n    \n    \n    ***Part II** Individual Provisions*\n    \n    __Article 12__\n    \n    Section 1: A person shall be guilty of harassment if that person publishes, displays, or issues abusive or threatening speech, writing, or other forms of media that expresses or encourages prejudice, insult, violence, suicide, or hatred against a particular individual; emphasizes on facts or truths that may cause distress to an individual; or builds up the context of a conversation in a way that may cause discomfort towards an individual.\n    \n    Section 2: Harassment may be committed against an individual on the basis of, but not limited to:\n        - race;\n        - religion;\n        - skin color;\n        - sexual identity;\n        - gender identity;\n        - ethnicity;\n        - disability; or\n        - national origin.\n    \n    Section 3: A person shall not be guilty of harassment if the content communicated was not intended to cause harm to any individuals.\n    \n    Section 4: A person guilty of harassment shall be issued a warning; kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    __Article 13__\n    \n    Section 1: A person shall be guilty of infringement of privacy if that person:\n        - intrudes, physically, electronically, or otherwise, upon the private space, solitude, or seclusion of a person, or the private affairs or concerns of a person, by use of the perpetrator's physical senses or by electronic device or devices to oversee or overhear the person's private affairs, or by some other form of investigation, examination, or observation intrude upon a person's private matters if the intrusion would be highly offensive to a reasonable person;\n        - publishes or widely disseminates little-known, private facts that are non-newsworthy, not part of public records, public proceedings, not of public interest, and would be offensive to a reasonable person if made public.\n        - publishes false information about an individual with the intent of causing harm to or create false public perception of that individual.\n    \n    Section 2: Acts which constitute infringement of privacy may include, but not limited to:\n        - publishing an individual's private phone number, email address, or other contact information without prior consent;\n        - publishing an individual's real name or face without prior consent; or\n        - publishing an individual's private messages or other communication without prior consent.\n    \n    Section 3: A person shall not be guilty of infringement of privacy if that person discloses to law enforcement or a court of law an individual's private information that, with plausible reasons, is believed to be of important use for the investigation of a possible crime.\n    \n    Section 4: A person guilty of infringement of privacy shall be issued a warning; kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    __Article 14__\n    \n    Section 1: A person shall be guilty of impersonation if that person pretends to be a different individual or a group of individuals by creating a new account or by altering an existing account for the purpose of committing fraudulent or malicious acts.\n    \n    Section 2: A person shall be guilty of impersonation of a public official if that persons impersonates an individual who holds offices of the Bayer Free State.\n    \n    Section 3: A person guilty of impersonation shall be issued a warning; kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    Section 4: If an alternative account is used in commissioning the crime of impersonation, that account shall be banned indefinitely.\n    \n    __Article 15__\n    \n    Section 1: A person shall be guilty of spamming when that person indiscriminately and unreasonably sends the same or nearly the same message multiple times within a short period of time with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience without reasonable cause.\n    \n    Section 2: A person shall not be guilty of spamming if the act is conducted in a channel designated for spamming.\n    \n    Section 3: A person guilty of spamming shall be issued a warning; or temporarily muted for not more than 15 days.\n    \n    __Article 16__\n    \n    Section 1: A person shall be guilty of unnecessary ping when that person mentions an individual, a group of individuals, a role, everyone, or here, with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience without reasonable cause.\n    \n    Section 2: A person shall not be guilty of unnecessary ping if the act is proven to be accidental.\n    \n    Section 3: A person guilty of unnecessary ping shall be issued a warning; or temporarily muted for not more than 15 days.\n    \n    __Article 17__\n    \n    Section 1: All obscene content, which includes content which contains nudity, intense sexuality, extreme violence, or other potentially disturbing subject matter, in any formats shall be prohibited from knowingly being posted in all channels except the designated channels for obscene content.\n    \n    Section 2: Accidental posting of obscene content shall be exempt from prosecution.\n    \n    Section 3: The posting of obscene content for non-inappropriate purposes shall be allowed, in which case the obscene content must be marked as spoiler or a warning must be posted beforehand.\n    \n    Section 4: Content containing inappropriate language which does not imply the aforementioned subject matter shall be excluded.\n    \n    Section 5: A person guilty of posting obscene content shall be issued a warning; kicked; or, temporarily banned from the State.\n    \n    __Article 18__\n    \n    Section 1: A person bearing Bayer Free State citizenship shall be guilty of treason if that person wages an act of aggression against the Bayer Free State, or collaborates with the enemies of the Bayer Free State within the State or somewhere else.\n    \n    Section 2: A person guilty of treason shall be kicked; or, temporary or indefinitely, banned from the State.\n    \n    __Article 19__\n    \n    Section 1: A person shall be guilty of insurrection if that person incites, assists, or engages in any rebellion against the authority of the Bayer Free State, its Constitution, or its laws.\n    \n    Section 2: A person guilty of insurrection shall be kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    __Article 20__\n    \n    Section 1: A person holding public offices of the Bayer Free State shall be guilty of abuse of power if that person commits an unlawful act using the power vested in such offices.\n    \n    Section 2: A person guilty of treason shall be suspended of qualifications; or, temporarily or indefinitely, deprived of qualifications.\n    \n    __Article 21__\n    \n    Section 1: A person shall be guilty of raiding if that person incites, assists, organizes, or engages in committing an unlawful act with a group of individuals with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience.\n    \n    Section 2: A person guilty of raiding shall be kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    __Article 22__\n    \n    Section 1: A person shall be guilty of fraud if that person knowingly and deliberately commences deception with the intention of securing unfair or unlawful gain, or depriving a victim of a legal right.\n    \n    Section 2: A person guilty of fraud shall be issued a warning; kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    __Article 23__\n    \n    Section 1: A person shall be guilty of sexual harassment if that person makes an unwanted or unwelcome sexual advance or request for sexual favors which is offensive, humiliating, or intimidating towards an individual; or communicating unwanted or unwelcome obscene and pornographic materials to an individual without consent.\n    \n    Section 2: A person committing sexual harassment towards a juvenile shall be guilty of child sexual harassment.\n    \n    Section 3: A person guilty of sexual harassment shall be kicked; or, temporary or indefinitely, muted, or banned from the State.\n    \n    Section 4: Additional punishments for child sexual harassment shall be applied.\n    \n    \n    ***Part III** Revocation*\n    \n    All criminal statutes enacted before the adoption of the 2021 Constitution, namely the legislation titled \"Laws of the Bayer Free State\", the Spam Act, the Account Act, the Ping Act, and Executive Order 1, shall hereby be repealed.\n    \n    ",
    "amendments": []
}