{
    "title": "2021 Congress Reform and Amendments Act",
    "referenceCode": "CON_2021_00004",
    "author": {
        "id": "584597326543323139",
        "username": "callmepeterz#1300"
      },
    "description": "Amends the Sixth and Seventh Amendments to the Constitution",
    "dateOfApproval": "29-12-2021",
    "isRepealed": false,
    "isApproved": true,
    "content": "**AN ACT**\n    *of the Congress of the Bayer Free State*\n    reference code CON_2021_00005.\n    \n    _Be it enacted by this Congress_, That, this legislation shall be cited as the \"2021 Congress Reform and Amendments Act\".\n    \n    \n    __Article I__: The following shall be amended to the Constitution of the Bayer Free State in accordance to Article VI of the Constitution.\n    \n    \n    **Amendment the Sixth**\n    \n    __Section 1__: \"since vacancy, the Office shall be vacant and the Head of State assumes the powers and duties of the Prime Minister\" of Amendment the Fifth, Section 2 shall be replaced by \"since an election is triggered, during which the Prime Minister and the Deputy Prime Minister shall hold their respective Offices until a new Prime Minister is elected\".\n    \n    __Section 2__: The election for the Prime Minister shall be fair and secret, and the instant runoff voting method shall be adopted.\n    \n    \n    **Amendment the Seventh**\n    \n    Article II, Section 2 shall be replaced with the following clause.\n        \"Members of Congress shall be elected in a fair and secret election using the single transferrable voting method held every six months. The number of seats of Congress shall be determined by the formula 2.25*(x^0.2) rounded down, in which x is the number of full citizens of the State. Should a seat become vacant, a fair and secret election shall be held using the instant runoff voting method for a replacement, who shall serve until the end of the contemporary Congress.\"\n    \n    \n    **Article II**: This Act shall go into effect on January 1st, 2022.",    
    "amendments": [],
    "version": 5
}